validation/oneWayCoupledVdfTransportFoam/spray1D/monoModal_nonLinear/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhase gas;
dilutePhase     liquid;

gas
{
    residualAlpha   0;
    d 1e-6;
}
liquid
{
    residualAlpha   1e-10;
    d 1e-6;
}

aspectRatio
{
    type constant;
    E0   1.0;
}

drag
{
    type        lengthBased;
    C           1.566e-7;
    residualRe  1e-3;

    swarmCorrection
    {
        type none;
    }
}
